Tekla Open API Reference for Tekla Structures 2025
ViewHandler Methods
The ViewHandler type exposes the following members.
Methods
Name | Description
GetActiveView
 Get the current active MDI child window view
GetAllViews
Fetches all the views from the model.
GetPermanentViews
Returns the permanent views.
GetSelectedViews
Returns the views the user has selected.
GetTemporaryViews
Returns the temporary views.
GetVisibleViews
Returns the visible views.
HideView
Closes a model view.
RedrawView
Redraws a model view.
RedrawWorkplane
Sets the workplane to current transformation plane and redraws it.
SetRepresentation
Sets the object representation.
ShowView
Opens a model view.
ZoomToBoundingBox(AABB)
Zooms the current model view.
ZoomToBoundingBox(View, AABB)
Zooms a model view.
Top
See Also
Reference
ViewHandler Class
Tekla.Structures.Model.UI Namespace